konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/clocks.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : CLOCKS
# Version        : 1
# Bus type       : apb
# =============================================================================
.ifndef	_HARDWARE_REGS_CLOCKS_H
.set	_HARDWARE_REGS_CLOCKS_H, 1
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT0_CTRL
# Description : Clock control, can be changed on-the-fly (except for auxsrc)
.equ	CLOCKS_CLK_GPOUT0_CTRL_OFFSET, 0x00000000
.equ	CLOCKS_CLK_GPOUT0_CTRL_BITS, 0x10131de0
.equ	CLOCKS_CLK_GPOUT0_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT0_CTRL_ENABLED
# Description : clock generator is enabled
.equ	CLOCKS_CLK_GPOUT0_CTRL_ENABLED_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT0_CTRL_ENABLED_BITS, 0x10000000
.equ	CLOCKS_CLK_GPOUT0_CTRL_ENABLED_MSB, 28
.equ	CLOCKS_CLK_GPOUT0_CTRL_ENABLED_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT0_CTRL_NUDGE
# Description : An edge on this signal shifts the phase of the output by 1
#               cycle of the input clock
#               This can be done at any time
.equ	CLOCKS_CLK_GPOUT0_CTRL_NUDGE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT0_CTRL_NUDGE_BITS, 0x00100000
.equ	CLOCKS_CLK_GPOUT0_CTRL_NUDGE_MSB, 20
.equ	CLOCKS_CLK_GPOUT0_CTRL_NUDGE_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT0_CTRL_PHASE
# Description : This delays the enable signal by up to 3 cycles of the input
#               clock
#               This must be set before the clock is enabled to have any effect
.equ	CLOCKS_CLK_GPOUT0_CTRL_PHASE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT0_CTRL_PHASE_BITS, 0x00030000
.equ	CLOCKS_CLK_GPOUT0_CTRL_PHASE_MSB, 17
.equ	CLOCKS_CLK_GPOUT0_CTRL_PHASE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT0_CTRL_DC50
# Description : Enables duty cycle correction for odd divisors, can be changed
#               on-the-fly
.equ	CLOCKS_CLK_GPOUT0_CTRL_DC50_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT0_CTRL_DC50_BITS, 0x00001000
.equ	CLOCKS_CLK_GPOUT0_CTRL_DC50_MSB, 12
.equ	CLOCKS_CLK_GPOUT0_CTRL_DC50_LSB, 12
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT0_CTRL_ENABLE
# Description : Starts and stops the clock generator cleanly
.equ	CLOCKS_CLK_GPOUT0_CTRL_ENABLE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT0_CTRL_ENABLE_BITS, 0x00000800
.equ	CLOCKS_CLK_GPOUT0_CTRL_ENABLE_MSB, 11
.equ	CLOCKS_CLK_GPOUT0_CTRL_ENABLE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT0_CTRL_KILL
# Description : Asynchronously kills the clock generator, enable must be set
#               low before deasserting kill
.equ	CLOCKS_CLK_GPOUT0_CTRL_KILL_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT0_CTRL_KILL_BITS, 0x00000400
.equ	CLOCKS_CLK_GPOUT0_CTRL_KILL_MSB, 10
.equ	CLOCKS_CLK_GPOUT0_CTRL_KILL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT0_CTRL_AUXSRC
# Description : Selects the auxiliary clock source, will glitch when switching
#               0x0 -> clksrc_pll_sys
#               0x1 -> clksrc_gpin0
#               0x2 -> clksrc_gpin1
#               0x3 -> clksrc_pll_usb
#               0x4 -> clksrc_pll_usb_primary_ref_opcg
#               0x5 -> rosc_clksrc
#               0x6 -> xosc_clksrc
#               0x7 -> lposc_clksrc
#               0x8 -> clk_sys
#               0x9 -> clk_usb
#               0xa -> clk_adc
#               0xb -> clk_ref
#               0xc -> clk_peri
#               0xd -> clk_hstx
#               0xe -> otp_clk2fc
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_BITS, 0x000001e0
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_MSB, 8
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_LSB, 5
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS, 0x0
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0, 0x1
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1, 0x2
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB, 0x3
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG, 0x4
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_ROSC_CLKSRC, 0x5
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_XOSC_CLKSRC, 0x6
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC, 0x7
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_SYS, 0x8
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_USB, 0x9
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_ADC, 0xa
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_REF, 0xb
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_PERI, 0xc
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_HSTX, 0xd
.equ	CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_OTP_CLK2FC, 0xe
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT0_DIV
.equ	CLOCKS_CLK_GPOUT0_DIV_OFFSET, 0x00000004
.equ	CLOCKS_CLK_GPOUT0_DIV_BITS, 0xffffffff
.equ	CLOCKS_CLK_GPOUT0_DIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT0_DIV_INT
# Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
#               the-fly
.equ	CLOCKS_CLK_GPOUT0_DIV_INT_RESET, 0x0001
.equ	CLOCKS_CLK_GPOUT0_DIV_INT_BITS, 0xffff0000
.equ	CLOCKS_CLK_GPOUT0_DIV_INT_MSB, 31
.equ	CLOCKS_CLK_GPOUT0_DIV_INT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT0_DIV_FRAC
# Description : Fractional component of the divisor, can be changed on-the-fly
.equ	CLOCKS_CLK_GPOUT0_DIV_FRAC_RESET, 0x0000
.equ	CLOCKS_CLK_GPOUT0_DIV_FRAC_BITS, 0x0000ffff
.equ	CLOCKS_CLK_GPOUT0_DIV_FRAC_MSB, 15
.equ	CLOCKS_CLK_GPOUT0_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT0_SELECTED
# Description : Indicates which src is currently selected (one-hot)
#               This slice does not have a glitchless mux (only the AUX_SRC
#               field is present, not SRC) so this register is hardwired to
#               0x1.
.equ	CLOCKS_CLK_GPOUT0_SELECTED_OFFSET, 0x00000008
.equ	CLOCKS_CLK_GPOUT0_SELECTED_BITS, 0x00000001
.equ	CLOCKS_CLK_GPOUT0_SELECTED_RESET, 0x00000001
.equ	CLOCKS_CLK_GPOUT0_SELECTED_MSB, 0
.equ	CLOCKS_CLK_GPOUT0_SELECTED_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT1_CTRL
# Description : Clock control, can be changed on-the-fly (except for auxsrc)
.equ	CLOCKS_CLK_GPOUT1_CTRL_OFFSET, 0x0000000c
.equ	CLOCKS_CLK_GPOUT1_CTRL_BITS, 0x10131de0
.equ	CLOCKS_CLK_GPOUT1_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT1_CTRL_ENABLED
# Description : clock generator is enabled
.equ	CLOCKS_CLK_GPOUT1_CTRL_ENABLED_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT1_CTRL_ENABLED_BITS, 0x10000000
.equ	CLOCKS_CLK_GPOUT1_CTRL_ENABLED_MSB, 28
.equ	CLOCKS_CLK_GPOUT1_CTRL_ENABLED_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT1_CTRL_NUDGE
# Description : An edge on this signal shifts the phase of the output by 1
#               cycle of the input clock
#               This can be done at any time
.equ	CLOCKS_CLK_GPOUT1_CTRL_NUDGE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT1_CTRL_NUDGE_BITS, 0x00100000
.equ	CLOCKS_CLK_GPOUT1_CTRL_NUDGE_MSB, 20
.equ	CLOCKS_CLK_GPOUT1_CTRL_NUDGE_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT1_CTRL_PHASE
# Description : This delays the enable signal by up to 3 cycles of the input
#               clock
#               This must be set before the clock is enabled to have any effect
.equ	CLOCKS_CLK_GPOUT1_CTRL_PHASE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT1_CTRL_PHASE_BITS, 0x00030000
.equ	CLOCKS_CLK_GPOUT1_CTRL_PHASE_MSB, 17
.equ	CLOCKS_CLK_GPOUT1_CTRL_PHASE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT1_CTRL_DC50
# Description : Enables duty cycle correction for odd divisors, can be changed
#               on-the-fly
.equ	CLOCKS_CLK_GPOUT1_CTRL_DC50_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT1_CTRL_DC50_BITS, 0x00001000
.equ	CLOCKS_CLK_GPOUT1_CTRL_DC50_MSB, 12
.equ	CLOCKS_CLK_GPOUT1_CTRL_DC50_LSB, 12
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT1_CTRL_ENABLE
# Description : Starts and stops the clock generator cleanly
.equ	CLOCKS_CLK_GPOUT1_CTRL_ENABLE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT1_CTRL_ENABLE_BITS, 0x00000800
.equ	CLOCKS_CLK_GPOUT1_CTRL_ENABLE_MSB, 11
.equ	CLOCKS_CLK_GPOUT1_CTRL_ENABLE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT1_CTRL_KILL
# Description : Asynchronously kills the clock generator, enable must be set
#               low before deasserting kill
.equ	CLOCKS_CLK_GPOUT1_CTRL_KILL_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT1_CTRL_KILL_BITS, 0x00000400
.equ	CLOCKS_CLK_GPOUT1_CTRL_KILL_MSB, 10
.equ	CLOCKS_CLK_GPOUT1_CTRL_KILL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT1_CTRL_AUXSRC
# Description : Selects the auxiliary clock source, will glitch when switching
#               0x0 -> clksrc_pll_sys
#               0x1 -> clksrc_gpin0
#               0x2 -> clksrc_gpin1
#               0x3 -> clksrc_pll_usb
#               0x4 -> clksrc_pll_usb_primary_ref_opcg
#               0x5 -> rosc_clksrc
#               0x6 -> xosc_clksrc
#               0x7 -> lposc_clksrc
#               0x8 -> clk_sys
#               0x9 -> clk_usb
#               0xa -> clk_adc
#               0xb -> clk_ref
#               0xc -> clk_peri
#               0xd -> clk_hstx
#               0xe -> otp_clk2fc
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_BITS, 0x000001e0
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_MSB, 8
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_LSB, 5
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS, 0x0
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0, 0x1
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1, 0x2
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB, 0x3
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG, 0x4
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_ROSC_CLKSRC, 0x5
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_XOSC_CLKSRC, 0x6
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC, 0x7
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_SYS, 0x8
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_USB, 0x9
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_ADC, 0xa
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_REF, 0xb
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_PERI, 0xc
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_HSTX, 0xd
.equ	CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_OTP_CLK2FC, 0xe
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT1_DIV
.equ	CLOCKS_CLK_GPOUT1_DIV_OFFSET, 0x00000010
.equ	CLOCKS_CLK_GPOUT1_DIV_BITS, 0xffffffff
.equ	CLOCKS_CLK_GPOUT1_DIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT1_DIV_INT
# Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
#               the-fly
.equ	CLOCKS_CLK_GPOUT1_DIV_INT_RESET, 0x0001
.equ	CLOCKS_CLK_GPOUT1_DIV_INT_BITS, 0xffff0000
.equ	CLOCKS_CLK_GPOUT1_DIV_INT_MSB, 31
.equ	CLOCKS_CLK_GPOUT1_DIV_INT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT1_DIV_FRAC
# Description : Fractional component of the divisor, can be changed on-the-fly
.equ	CLOCKS_CLK_GPOUT1_DIV_FRAC_RESET, 0x0000
.equ	CLOCKS_CLK_GPOUT1_DIV_FRAC_BITS, 0x0000ffff
.equ	CLOCKS_CLK_GPOUT1_DIV_FRAC_MSB, 15
.equ	CLOCKS_CLK_GPOUT1_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT1_SELECTED
# Description : Indicates which src is currently selected (one-hot)
#               This slice does not have a glitchless mux (only the AUX_SRC
#               field is present, not SRC) so this register is hardwired to
#               0x1.
.equ	CLOCKS_CLK_GPOUT1_SELECTED_OFFSET, 0x00000014
.equ	CLOCKS_CLK_GPOUT1_SELECTED_BITS, 0x00000001
.equ	CLOCKS_CLK_GPOUT1_SELECTED_RESET, 0x00000001
.equ	CLOCKS_CLK_GPOUT1_SELECTED_MSB, 0
.equ	CLOCKS_CLK_GPOUT1_SELECTED_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT2_CTRL
# Description : Clock control, can be changed on-the-fly (except for auxsrc)
.equ	CLOCKS_CLK_GPOUT2_CTRL_OFFSET, 0x00000018
.equ	CLOCKS_CLK_GPOUT2_CTRL_BITS, 0x10131de0
.equ	CLOCKS_CLK_GPOUT2_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT2_CTRL_ENABLED
# Description : clock generator is enabled
.equ	CLOCKS_CLK_GPOUT2_CTRL_ENABLED_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT2_CTRL_ENABLED_BITS, 0x10000000
.equ	CLOCKS_CLK_GPOUT2_CTRL_ENABLED_MSB, 28
.equ	CLOCKS_CLK_GPOUT2_CTRL_ENABLED_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT2_CTRL_NUDGE
# Description : An edge on this signal shifts the phase of the output by 1
#               cycle of the input clock
#               This can be done at any time
.equ	CLOCKS_CLK_GPOUT2_CTRL_NUDGE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT2_CTRL_NUDGE_BITS, 0x00100000
.equ	CLOCKS_CLK_GPOUT2_CTRL_NUDGE_MSB, 20
.equ	CLOCKS_CLK_GPOUT2_CTRL_NUDGE_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT2_CTRL_PHASE
# Description : This delays the enable signal by up to 3 cycles of the input
#               clock
#               This must be set before the clock is enabled to have any effect
.equ	CLOCKS_CLK_GPOUT2_CTRL_PHASE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT2_CTRL_PHASE_BITS, 0x00030000
.equ	CLOCKS_CLK_GPOUT2_CTRL_PHASE_MSB, 17
.equ	CLOCKS_CLK_GPOUT2_CTRL_PHASE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT2_CTRL_DC50
# Description : Enables duty cycle correction for odd divisors, can be changed
#               on-the-fly
.equ	CLOCKS_CLK_GPOUT2_CTRL_DC50_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT2_CTRL_DC50_BITS, 0x00001000
.equ	CLOCKS_CLK_GPOUT2_CTRL_DC50_MSB, 12
.equ	CLOCKS_CLK_GPOUT2_CTRL_DC50_LSB, 12
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT2_CTRL_ENABLE
# Description : Starts and stops the clock generator cleanly
.equ	CLOCKS_CLK_GPOUT2_CTRL_ENABLE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT2_CTRL_ENABLE_BITS, 0x00000800
.equ	CLOCKS_CLK_GPOUT2_CTRL_ENABLE_MSB, 11
.equ	CLOCKS_CLK_GPOUT2_CTRL_ENABLE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT2_CTRL_KILL
# Description : Asynchronously kills the clock generator, enable must be set
#               low before deasserting kill
.equ	CLOCKS_CLK_GPOUT2_CTRL_KILL_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT2_CTRL_KILL_BITS, 0x00000400
.equ	CLOCKS_CLK_GPOUT2_CTRL_KILL_MSB, 10
.equ	CLOCKS_CLK_GPOUT2_CTRL_KILL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT2_CTRL_AUXSRC
# Description : Selects the auxiliary clock source, will glitch when switching
#               0x0 -> clksrc_pll_sys
#               0x1 -> clksrc_gpin0
#               0x2 -> clksrc_gpin1
#               0x3 -> clksrc_pll_usb
#               0x4 -> clksrc_pll_usb_primary_ref_opcg
#               0x5 -> rosc_clksrc_ph
#               0x6 -> xosc_clksrc
#               0x7 -> lposc_clksrc
#               0x8 -> clk_sys
#               0x9 -> clk_usb
#               0xa -> clk_adc
#               0xb -> clk_ref
#               0xc -> clk_peri
#               0xd -> clk_hstx
#               0xe -> otp_clk2fc
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_BITS, 0x000001e0
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_MSB, 8
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_LSB, 5
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS, 0x0
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0, 0x1
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1, 0x2
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB, 0x3
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG, 0x4
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH, 0x5
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_XOSC_CLKSRC, 0x6
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC, 0x7
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_SYS, 0x8
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_USB, 0x9
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_ADC, 0xa
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_REF, 0xb
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_PERI, 0xc
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_HSTX, 0xd
.equ	CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_OTP_CLK2FC, 0xe
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT2_DIV
.equ	CLOCKS_CLK_GPOUT2_DIV_OFFSET, 0x0000001c
.equ	CLOCKS_CLK_GPOUT2_DIV_BITS, 0xffffffff
.equ	CLOCKS_CLK_GPOUT2_DIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT2_DIV_INT
# Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
#               the-fly
.equ	CLOCKS_CLK_GPOUT2_DIV_INT_RESET, 0x0001
.equ	CLOCKS_CLK_GPOUT2_DIV_INT_BITS, 0xffff0000
.equ	CLOCKS_CLK_GPOUT2_DIV_INT_MSB, 31
.equ	CLOCKS_CLK_GPOUT2_DIV_INT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT2_DIV_FRAC
# Description : Fractional component of the divisor, can be changed on-the-fly
.equ	CLOCKS_CLK_GPOUT2_DIV_FRAC_RESET, 0x0000
.equ	CLOCKS_CLK_GPOUT2_DIV_FRAC_BITS, 0x0000ffff
.equ	CLOCKS_CLK_GPOUT2_DIV_FRAC_MSB, 15
.equ	CLOCKS_CLK_GPOUT2_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT2_SELECTED
# Description : Indicates which src is currently selected (one-hot)
#               This slice does not have a glitchless mux (only the AUX_SRC
#               field is present, not SRC) so this register is hardwired to
#               0x1.
.equ	CLOCKS_CLK_GPOUT2_SELECTED_OFFSET, 0x00000020
.equ	CLOCKS_CLK_GPOUT2_SELECTED_BITS, 0x00000001
.equ	CLOCKS_CLK_GPOUT2_SELECTED_RESET, 0x00000001
.equ	CLOCKS_CLK_GPOUT2_SELECTED_MSB, 0
.equ	CLOCKS_CLK_GPOUT2_SELECTED_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT3_CTRL
# Description : Clock control, can be changed on-the-fly (except for auxsrc)
.equ	CLOCKS_CLK_GPOUT3_CTRL_OFFSET, 0x00000024
.equ	CLOCKS_CLK_GPOUT3_CTRL_BITS, 0x10131de0
.equ	CLOCKS_CLK_GPOUT3_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT3_CTRL_ENABLED
# Description : clock generator is enabled
.equ	CLOCKS_CLK_GPOUT3_CTRL_ENABLED_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT3_CTRL_ENABLED_BITS, 0x10000000
.equ	CLOCKS_CLK_GPOUT3_CTRL_ENABLED_MSB, 28
.equ	CLOCKS_CLK_GPOUT3_CTRL_ENABLED_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT3_CTRL_NUDGE
# Description : An edge on this signal shifts the phase of the output by 1
#               cycle of the input clock
#               This can be done at any time
.equ	CLOCKS_CLK_GPOUT3_CTRL_NUDGE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT3_CTRL_NUDGE_BITS, 0x00100000
.equ	CLOCKS_CLK_GPOUT3_CTRL_NUDGE_MSB, 20
.equ	CLOCKS_CLK_GPOUT3_CTRL_NUDGE_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT3_CTRL_PHASE
# Description : This delays the enable signal by up to 3 cycles of the input
#               clock
#               This must be set before the clock is enabled to have any effect
.equ	CLOCKS_CLK_GPOUT3_CTRL_PHASE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT3_CTRL_PHASE_BITS, 0x00030000
.equ	CLOCKS_CLK_GPOUT3_CTRL_PHASE_MSB, 17
.equ	CLOCKS_CLK_GPOUT3_CTRL_PHASE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT3_CTRL_DC50
# Description : Enables duty cycle correction for odd divisors, can be changed
#               on-the-fly
.equ	CLOCKS_CLK_GPOUT3_CTRL_DC50_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT3_CTRL_DC50_BITS, 0x00001000
.equ	CLOCKS_CLK_GPOUT3_CTRL_DC50_MSB, 12
.equ	CLOCKS_CLK_GPOUT3_CTRL_DC50_LSB, 12
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT3_CTRL_ENABLE
# Description : Starts and stops the clock generator cleanly
.equ	CLOCKS_CLK_GPOUT3_CTRL_ENABLE_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT3_CTRL_ENABLE_BITS, 0x00000800
.equ	CLOCKS_CLK_GPOUT3_CTRL_ENABLE_MSB, 11
.equ	CLOCKS_CLK_GPOUT3_CTRL_ENABLE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT3_CTRL_KILL
# Description : Asynchronously kills the clock generator, enable must be set
#               low before deasserting kill
.equ	CLOCKS_CLK_GPOUT3_CTRL_KILL_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT3_CTRL_KILL_BITS, 0x00000400
.equ	CLOCKS_CLK_GPOUT3_CTRL_KILL_MSB, 10
.equ	CLOCKS_CLK_GPOUT3_CTRL_KILL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT3_CTRL_AUXSRC
# Description : Selects the auxiliary clock source, will glitch when switching
#               0x0 -> clksrc_pll_sys
#               0x1 -> clksrc_gpin0
#               0x2 -> clksrc_gpin1
#               0x3 -> clksrc_pll_usb
#               0x4 -> clksrc_pll_usb_primary_ref_opcg
#               0x5 -> rosc_clksrc_ph
#               0x6 -> xosc_clksrc
#               0x7 -> lposc_clksrc
#               0x8 -> clk_sys
#               0x9 -> clk_usb
#               0xa -> clk_adc
#               0xb -> clk_ref
#               0xc -> clk_peri
#               0xd -> clk_hstx
#               0xe -> otp_clk2fc
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_RESET, 0x0
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_BITS, 0x000001e0
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_MSB, 8
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_LSB, 5
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS, 0x0
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0, 0x1
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1, 0x2
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB, 0x3
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG, 0x4
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH, 0x5
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_XOSC_CLKSRC, 0x6
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC, 0x7
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_SYS, 0x8
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_USB, 0x9
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_ADC, 0xa
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_REF, 0xb
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_PERI, 0xc
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_HSTX, 0xd
.equ	CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_OTP_CLK2FC, 0xe
# =============================================================================
