konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/clocks.inc
# Register    : CLOCKS_CLK_GPOUT3_DIV
.equ	CLOCKS_CLK_GPOUT3_DIV_OFFSET, 0x00000028
.equ	CLOCKS_CLK_GPOUT3_DIV_BITS, 0xffffffff
.equ	CLOCKS_CLK_GPOUT3_DIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT3_DIV_INT
# Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
#               the-fly
.equ	CLOCKS_CLK_GPOUT3_DIV_INT_RESET, 0x0001
.equ	CLOCKS_CLK_GPOUT3_DIV_INT_BITS, 0xffff0000
.equ	CLOCKS_CLK_GPOUT3_DIV_INT_MSB, 31
.equ	CLOCKS_CLK_GPOUT3_DIV_INT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_GPOUT3_DIV_FRAC
# Description : Fractional component of the divisor, can be changed on-the-fly
.equ	CLOCKS_CLK_GPOUT3_DIV_FRAC_RESET, 0x0000
.equ	CLOCKS_CLK_GPOUT3_DIV_FRAC_BITS, 0x0000ffff
.equ	CLOCKS_CLK_GPOUT3_DIV_FRAC_MSB, 15
.equ	CLOCKS_CLK_GPOUT3_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_GPOUT3_SELECTED
# Description : Indicates which src is currently selected (one-hot)
#               This slice does not have a glitchless mux (only the AUX_SRC
#               field is present, not SRC) so this register is hardwired to
#               0x1.
.equ	CLOCKS_CLK_GPOUT3_SELECTED_OFFSET, 0x0000002c
.equ	CLOCKS_CLK_GPOUT3_SELECTED_BITS, 0x00000001
.equ	CLOCKS_CLK_GPOUT3_SELECTED_RESET, 0x00000001
.equ	CLOCKS_CLK_GPOUT3_SELECTED_MSB, 0
.equ	CLOCKS_CLK_GPOUT3_SELECTED_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_REF_CTRL
# Description : Clock control, can be changed on-the-fly (except for auxsrc)
.equ	CLOCKS_CLK_REF_CTRL_OFFSET, 0x00000030
.equ	CLOCKS_CLK_REF_CTRL_BITS, 0x00000063
.equ	CLOCKS_CLK_REF_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_REF_CTRL_AUXSRC
# Description : Selects the auxiliary clock source, will glitch when switching
#               0x0 -> clksrc_pll_usb
#               0x1 -> clksrc_gpin0
#               0x2 -> clksrc_gpin1
#               0x3 -> clksrc_pll_usb_primary_ref_opcg
.equ	CLOCKS_CLK_REF_CTRL_AUXSRC_RESET, 0x0
.equ	CLOCKS_CLK_REF_CTRL_AUXSRC_BITS, 0x00000060
.equ	CLOCKS_CLK_REF_CTRL_AUXSRC_MSB, 6
.equ	CLOCKS_CLK_REF_CTRL_AUXSRC_LSB, 5
.equ	CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB, 0x0
.equ	CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0, 0x1
.equ	CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1, 0x2
.equ	CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG, 0x3
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_REF_CTRL_SRC
# Description : Selects the clock source glitchlessly, can be changed on-the-
#               fly
#               0x0 -> rosc_clksrc_ph
#               0x1 -> clksrc_clk_ref_aux
#               0x2 -> xosc_clksrc
#               0x3 -> lposc_clksrc
.equ	CLOCKS_CLK_REF_CTRL_SRC_BITS, 0x00000003
.equ	CLOCKS_CLK_REF_CTRL_SRC_MSB, 1
.equ	CLOCKS_CLK_REF_CTRL_SRC_LSB, 0
.equ	CLOCKS_CLK_REF_CTRL_SRC_VALUE_ROSC_CLKSRC_PH, 0x0
.equ	CLOCKS_CLK_REF_CTRL_SRC_VALUE_CLKSRC_CLK_REF_AUX, 0x1
.equ	CLOCKS_CLK_REF_CTRL_SRC_VALUE_XOSC_CLKSRC, 0x2
.equ	CLOCKS_CLK_REF_CTRL_SRC_VALUE_LPOSC_CLKSRC, 0x3
# =============================================================================
# Register    : CLOCKS_CLK_REF_DIV
.equ	CLOCKS_CLK_REF_DIV_OFFSET, 0x00000034
.equ	CLOCKS_CLK_REF_DIV_BITS, 0x00ff0000
.equ	CLOCKS_CLK_REF_DIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_REF_DIV_INT
# Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
#               the-fly
.equ	CLOCKS_CLK_REF_DIV_INT_RESET, 0x01
.equ	CLOCKS_CLK_REF_DIV_INT_BITS, 0x00ff0000
.equ	CLOCKS_CLK_REF_DIV_INT_MSB, 23
.equ	CLOCKS_CLK_REF_DIV_INT_LSB, 16
# =============================================================================
# Register    : CLOCKS_CLK_REF_SELECTED
# Description : Indicates which src is currently selected (one-hot)
#               The glitchless multiplexer does not switch instantaneously (to
#               avoid glitches), so software should poll this register to wait
#               for the switch to complete. This register contains one decoded
#               bit for each of the clock sources enumerated in the CTRL SRC
#               field. At most one of these bits will be set at any time,
#               indicating that clock is currently present at the output of the
#               glitchless mux. Whilst switching is in progress, this register
#               may briefly show all-0s.
.equ	CLOCKS_CLK_REF_SELECTED_OFFSET, 0x00000038
.equ	CLOCKS_CLK_REF_SELECTED_BITS, 0x0000000f
.equ	CLOCKS_CLK_REF_SELECTED_RESET, 0x00000001
.equ	CLOCKS_CLK_REF_SELECTED_MSB, 3
.equ	CLOCKS_CLK_REF_SELECTED_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_SYS_CTRL
# Description : Clock control, can be changed on-the-fly (except for auxsrc)
.equ	CLOCKS_CLK_SYS_CTRL_OFFSET, 0x0000003c
.equ	CLOCKS_CLK_SYS_CTRL_BITS, 0x000000e1
.equ	CLOCKS_CLK_SYS_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_SYS_CTRL_AUXSRC
# Description : Selects the auxiliary clock source, will glitch when switching
#               0x0 -> clksrc_pll_sys
#               0x1 -> clksrc_pll_usb
#               0x2 -> rosc_clksrc
#               0x3 -> xosc_clksrc
#               0x4 -> clksrc_gpin0
#               0x5 -> clksrc_gpin1
.equ	CLOCKS_CLK_SYS_CTRL_AUXSRC_RESET, 0x0
.equ	CLOCKS_CLK_SYS_CTRL_AUXSRC_BITS, 0x000000e0
.equ	CLOCKS_CLK_SYS_CTRL_AUXSRC_MSB, 7
.equ	CLOCKS_CLK_SYS_CTRL_AUXSRC_LSB, 5
.equ	CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS, 0x0
.equ	CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB, 0x1
.equ	CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_ROSC_CLKSRC, 0x2
.equ	CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_XOSC_CLKSRC, 0x3
.equ	CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0, 0x4
.equ	CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1, 0x5
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_SYS_CTRL_SRC
# Description : Selects the clock source glitchlessly, can be changed on-the-
#               fly
#               0x0 -> clk_ref
#               0x1 -> clksrc_clk_sys_aux
.equ	CLOCKS_CLK_SYS_CTRL_SRC_RESET, 0x0
.equ	CLOCKS_CLK_SYS_CTRL_SRC_BITS, 0x00000001
.equ	CLOCKS_CLK_SYS_CTRL_SRC_MSB, 0
.equ	CLOCKS_CLK_SYS_CTRL_SRC_LSB, 0
.equ	CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLK_REF, 0x0
.equ	CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX, 0x1
# =============================================================================
# Register    : CLOCKS_CLK_SYS_DIV
.equ	CLOCKS_CLK_SYS_DIV_OFFSET, 0x00000040
.equ	CLOCKS_CLK_SYS_DIV_BITS, 0xffffffff
.equ	CLOCKS_CLK_SYS_DIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_SYS_DIV_INT
# Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
#               the-fly
.equ	CLOCKS_CLK_SYS_DIV_INT_RESET, 0x0001
.equ	CLOCKS_CLK_SYS_DIV_INT_BITS, 0xffff0000
.equ	CLOCKS_CLK_SYS_DIV_INT_MSB, 31
.equ	CLOCKS_CLK_SYS_DIV_INT_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_SYS_DIV_FRAC
# Description : Fractional component of the divisor, can be changed on-the-fly
.equ	CLOCKS_CLK_SYS_DIV_FRAC_RESET, 0x0000
.equ	CLOCKS_CLK_SYS_DIV_FRAC_BITS, 0x0000ffff
.equ	CLOCKS_CLK_SYS_DIV_FRAC_MSB, 15
.equ	CLOCKS_CLK_SYS_DIV_FRAC_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_SYS_SELECTED
# Description : Indicates which src is currently selected (one-hot)
#               The glitchless multiplexer does not switch instantaneously (to
#               avoid glitches), so software should poll this register to wait
#               for the switch to complete. This register contains one decoded
#               bit for each of the clock sources enumerated in the CTRL SRC
#               field. At most one of these bits will be set at any time,
#               indicating that clock is currently present at the output of the
#               glitchless mux. Whilst switching is in progress, this register
#               may briefly show all-0s.
.equ	CLOCKS_CLK_SYS_SELECTED_OFFSET, 0x00000044
.equ	CLOCKS_CLK_SYS_SELECTED_BITS, 0x00000003
.equ	CLOCKS_CLK_SYS_SELECTED_RESET, 0x00000001
.equ	CLOCKS_CLK_SYS_SELECTED_MSB, 1
.equ	CLOCKS_CLK_SYS_SELECTED_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_PERI_CTRL
# Description : Clock control, can be changed on-the-fly (except for auxsrc)
.equ	CLOCKS_CLK_PERI_CTRL_OFFSET, 0x00000048
.equ	CLOCKS_CLK_PERI_CTRL_BITS, 0x10000ce0
.equ	CLOCKS_CLK_PERI_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_PERI_CTRL_ENABLED
# Description : clock generator is enabled
.equ	CLOCKS_CLK_PERI_CTRL_ENABLED_RESET, 0x0
.equ	CLOCKS_CLK_PERI_CTRL_ENABLED_BITS, 0x10000000
.equ	CLOCKS_CLK_PERI_CTRL_ENABLED_MSB, 28
.equ	CLOCKS_CLK_PERI_CTRL_ENABLED_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_PERI_CTRL_ENABLE
# Description : Starts and stops the clock generator cleanly
.equ	CLOCKS_CLK_PERI_CTRL_ENABLE_RESET, 0x0
.equ	CLOCKS_CLK_PERI_CTRL_ENABLE_BITS, 0x00000800
.equ	CLOCKS_CLK_PERI_CTRL_ENABLE_MSB, 11
.equ	CLOCKS_CLK_PERI_CTRL_ENABLE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_PERI_CTRL_KILL
# Description : Asynchronously kills the clock generator, enable must be set
#               low before deasserting kill
.equ	CLOCKS_CLK_PERI_CTRL_KILL_RESET, 0x0
.equ	CLOCKS_CLK_PERI_CTRL_KILL_BITS, 0x00000400
.equ	CLOCKS_CLK_PERI_CTRL_KILL_MSB, 10
.equ	CLOCKS_CLK_PERI_CTRL_KILL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_PERI_CTRL_AUXSRC
# Description : Selects the auxiliary clock source, will glitch when switching
#               0x0 -> clk_sys
#               0x1 -> clksrc_pll_sys
#               0x2 -> clksrc_pll_usb
#               0x3 -> rosc_clksrc_ph
#               0x4 -> xosc_clksrc
#               0x5 -> clksrc_gpin0
#               0x6 -> clksrc_gpin1
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_RESET, 0x0
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_BITS, 0x000000e0
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_MSB, 7
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_LSB, 5
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLK_SYS, 0x0
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS, 0x1
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB, 0x2
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH, 0x3
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_XOSC_CLKSRC, 0x4
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0, 0x5
.equ	CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1, 0x6
# =============================================================================
# Register    : CLOCKS_CLK_PERI_DIV
.equ	CLOCKS_CLK_PERI_DIV_OFFSET, 0x0000004c
.equ	CLOCKS_CLK_PERI_DIV_BITS, 0x00030000
.equ	CLOCKS_CLK_PERI_DIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_PERI_DIV_INT
# Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
#               the-fly
.equ	CLOCKS_CLK_PERI_DIV_INT_RESET, 0x1
.equ	CLOCKS_CLK_PERI_DIV_INT_BITS, 0x00030000
.equ	CLOCKS_CLK_PERI_DIV_INT_MSB, 17
.equ	CLOCKS_CLK_PERI_DIV_INT_LSB, 16
# =============================================================================
# Register    : CLOCKS_CLK_PERI_SELECTED
# Description : Indicates which src is currently selected (one-hot)
#               This slice does not have a glitchless mux (only the AUX_SRC
#               field is present, not SRC) so this register is hardwired to
#               0x1.
.equ	CLOCKS_CLK_PERI_SELECTED_OFFSET, 0x00000050
.equ	CLOCKS_CLK_PERI_SELECTED_BITS, 0x00000001
.equ	CLOCKS_CLK_PERI_SELECTED_RESET, 0x00000001
.equ	CLOCKS_CLK_PERI_SELECTED_MSB, 0
.equ	CLOCKS_CLK_PERI_SELECTED_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_HSTX_CTRL
# Description : Clock control, can be changed on-the-fly (except for auxsrc)
.equ	CLOCKS_CLK_HSTX_CTRL_OFFSET, 0x00000054
.equ	CLOCKS_CLK_HSTX_CTRL_BITS, 0x10130ce0
.equ	CLOCKS_CLK_HSTX_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_HSTX_CTRL_ENABLED
# Description : clock generator is enabled
.equ	CLOCKS_CLK_HSTX_CTRL_ENABLED_RESET, 0x0
.equ	CLOCKS_CLK_HSTX_CTRL_ENABLED_BITS, 0x10000000
.equ	CLOCKS_CLK_HSTX_CTRL_ENABLED_MSB, 28
.equ	CLOCKS_CLK_HSTX_CTRL_ENABLED_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_HSTX_CTRL_NUDGE
# Description : An edge on this signal shifts the phase of the output by 1
#               cycle of the input clock
#               This can be done at any time
.equ	CLOCKS_CLK_HSTX_CTRL_NUDGE_RESET, 0x0
.equ	CLOCKS_CLK_HSTX_CTRL_NUDGE_BITS, 0x00100000
.equ	CLOCKS_CLK_HSTX_CTRL_NUDGE_MSB, 20
.equ	CLOCKS_CLK_HSTX_CTRL_NUDGE_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_HSTX_CTRL_PHASE
# Description : This delays the enable signal by up to 3 cycles of the input
#               clock
#               This must be set before the clock is enabled to have any effect
.equ	CLOCKS_CLK_HSTX_CTRL_PHASE_RESET, 0x0
.equ	CLOCKS_CLK_HSTX_CTRL_PHASE_BITS, 0x00030000
.equ	CLOCKS_CLK_HSTX_CTRL_PHASE_MSB, 17
.equ	CLOCKS_CLK_HSTX_CTRL_PHASE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_HSTX_CTRL_ENABLE
# Description : Starts and stops the clock generator cleanly
.equ	CLOCKS_CLK_HSTX_CTRL_ENABLE_RESET, 0x0
.equ	CLOCKS_CLK_HSTX_CTRL_ENABLE_BITS, 0x00000800
.equ	CLOCKS_CLK_HSTX_CTRL_ENABLE_MSB, 11
.equ	CLOCKS_CLK_HSTX_CTRL_ENABLE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_HSTX_CTRL_KILL
# Description : Asynchronously kills the clock generator, enable must be set
#               low before deasserting kill
.equ	CLOCKS_CLK_HSTX_CTRL_KILL_RESET, 0x0
.equ	CLOCKS_CLK_HSTX_CTRL_KILL_BITS, 0x00000400
.equ	CLOCKS_CLK_HSTX_CTRL_KILL_MSB, 10
.equ	CLOCKS_CLK_HSTX_CTRL_KILL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_HSTX_CTRL_AUXSRC
# Description : Selects the auxiliary clock source, will glitch when switching
#               0x0 -> clk_sys
#               0x1 -> clksrc_pll_sys
#               0x2 -> clksrc_pll_usb
#               0x3 -> clksrc_gpin0
#               0x4 -> clksrc_gpin1
.equ	CLOCKS_CLK_HSTX_CTRL_AUXSRC_RESET, 0x0
.equ	CLOCKS_CLK_HSTX_CTRL_AUXSRC_BITS, 0x000000e0
.equ	CLOCKS_CLK_HSTX_CTRL_AUXSRC_MSB, 7
.equ	CLOCKS_CLK_HSTX_CTRL_AUXSRC_LSB, 5
.equ	CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLK_SYS, 0x0
.equ	CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS, 0x1
.equ	CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB, 0x2
.equ	CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0, 0x3
.equ	CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1, 0x4
# =============================================================================
# Register    : CLOCKS_CLK_HSTX_DIV
.equ	CLOCKS_CLK_HSTX_DIV_OFFSET, 0x00000058
.equ	CLOCKS_CLK_HSTX_DIV_BITS, 0x00030000
.equ	CLOCKS_CLK_HSTX_DIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_HSTX_DIV_INT
# Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
#               the-fly
.equ	CLOCKS_CLK_HSTX_DIV_INT_RESET, 0x1
.equ	CLOCKS_CLK_HSTX_DIV_INT_BITS, 0x00030000
.equ	CLOCKS_CLK_HSTX_DIV_INT_MSB, 17
.equ	CLOCKS_CLK_HSTX_DIV_INT_LSB, 16
# =============================================================================
# Register    : CLOCKS_CLK_HSTX_SELECTED
# Description : Indicates which src is currently selected (one-hot)
#               This slice does not have a glitchless mux (only the AUX_SRC
#               field is present, not SRC) so this register is hardwired to
#               0x1.
.equ	CLOCKS_CLK_HSTX_SELECTED_OFFSET, 0x0000005c
.equ	CLOCKS_CLK_HSTX_SELECTED_BITS, 0x00000001
.equ	CLOCKS_CLK_HSTX_SELECTED_RESET, 0x00000001
.equ	CLOCKS_CLK_HSTX_SELECTED_MSB, 0
.equ	CLOCKS_CLK_HSTX_SELECTED_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_USB_CTRL
# Description : Clock control, can be changed on-the-fly (except for auxsrc)
.equ	CLOCKS_CLK_USB_CTRL_OFFSET, 0x00000060
.equ	CLOCKS_CLK_USB_CTRL_BITS, 0x10130ce0
.equ	CLOCKS_CLK_USB_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_USB_CTRL_ENABLED
# Description : clock generator is enabled
.equ	CLOCKS_CLK_USB_CTRL_ENABLED_RESET, 0x0
.equ	CLOCKS_CLK_USB_CTRL_ENABLED_BITS, 0x10000000
.equ	CLOCKS_CLK_USB_CTRL_ENABLED_MSB, 28
.equ	CLOCKS_CLK_USB_CTRL_ENABLED_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_USB_CTRL_NUDGE
# Description : An edge on this signal shifts the phase of the output by 1
#               cycle of the input clock
#               This can be done at any time
.equ	CLOCKS_CLK_USB_CTRL_NUDGE_RESET, 0x0
.equ	CLOCKS_CLK_USB_CTRL_NUDGE_BITS, 0x00100000
.equ	CLOCKS_CLK_USB_CTRL_NUDGE_MSB, 20
.equ	CLOCKS_CLK_USB_CTRL_NUDGE_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_USB_CTRL_PHASE
# Description : This delays the enable signal by up to 3 cycles of the input
#               clock
#               This must be set before the clock is enabled to have any effect
.equ	CLOCKS_CLK_USB_CTRL_PHASE_RESET, 0x0
.equ	CLOCKS_CLK_USB_CTRL_PHASE_BITS, 0x00030000
.equ	CLOCKS_CLK_USB_CTRL_PHASE_MSB, 17
.equ	CLOCKS_CLK_USB_CTRL_PHASE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_USB_CTRL_ENABLE
# Description : Starts and stops the clock generator cleanly
.equ	CLOCKS_CLK_USB_CTRL_ENABLE_RESET, 0x0
.equ	CLOCKS_CLK_USB_CTRL_ENABLE_BITS, 0x00000800
.equ	CLOCKS_CLK_USB_CTRL_ENABLE_MSB, 11
.equ	CLOCKS_CLK_USB_CTRL_ENABLE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_USB_CTRL_KILL
# Description : Asynchronously kills the clock generator, enable must be set
#               low before deasserting kill
.equ	CLOCKS_CLK_USB_CTRL_KILL_RESET, 0x0
.equ	CLOCKS_CLK_USB_CTRL_KILL_BITS, 0x00000400
.equ	CLOCKS_CLK_USB_CTRL_KILL_MSB, 10
.equ	CLOCKS_CLK_USB_CTRL_KILL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_USB_CTRL_AUXSRC
# Description : Selects the auxiliary clock source, will glitch when switching
#               0x0 -> clksrc_pll_usb
#               0x1 -> clksrc_pll_sys
#               0x2 -> rosc_clksrc_ph
#               0x3 -> xosc_clksrc
#               0x4 -> clksrc_gpin0
#               0x5 -> clksrc_gpin1
.equ	CLOCKS_CLK_USB_CTRL_AUXSRC_RESET, 0x0
.equ	CLOCKS_CLK_USB_CTRL_AUXSRC_BITS, 0x000000e0
.equ	CLOCKS_CLK_USB_CTRL_AUXSRC_MSB, 7
.equ	CLOCKS_CLK_USB_CTRL_AUXSRC_LSB, 5
.equ	CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB, 0x0
.equ	CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS, 0x1
.equ	CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH, 0x2
.equ	CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_XOSC_CLKSRC, 0x3
.equ	CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0, 0x4
.equ	CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1, 0x5
# =============================================================================
# Register    : CLOCKS_CLK_USB_DIV
.equ	CLOCKS_CLK_USB_DIV_OFFSET, 0x00000064
.equ	CLOCKS_CLK_USB_DIV_BITS, 0x000f0000
.equ	CLOCKS_CLK_USB_DIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_USB_DIV_INT
# Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
#               the-fly
.equ	CLOCKS_CLK_USB_DIV_INT_RESET, 0x1
.equ	CLOCKS_CLK_USB_DIV_INT_BITS, 0x000f0000
.equ	CLOCKS_CLK_USB_DIV_INT_MSB, 19
.equ	CLOCKS_CLK_USB_DIV_INT_LSB, 16
# =============================================================================
# Register    : CLOCKS_CLK_USB_SELECTED
# Description : Indicates which src is currently selected (one-hot)
#               This slice does not have a glitchless mux (only the AUX_SRC
#               field is present, not SRC) so this register is hardwired to
#               0x1.
.equ	CLOCKS_CLK_USB_SELECTED_OFFSET, 0x00000068
.equ	CLOCKS_CLK_USB_SELECTED_BITS, 0x00000001
.equ	CLOCKS_CLK_USB_SELECTED_RESET, 0x00000001
.equ	CLOCKS_CLK_USB_SELECTED_MSB, 0
.equ	CLOCKS_CLK_USB_SELECTED_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_ADC_CTRL
# Description : Clock control, can be changed on-the-fly (except for auxsrc)
.equ	CLOCKS_CLK_ADC_CTRL_OFFSET, 0x0000006c
.equ	CLOCKS_CLK_ADC_CTRL_BITS, 0x10130ce0
.equ	CLOCKS_CLK_ADC_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_ADC_CTRL_ENABLED
# Description : clock generator is enabled
.equ	CLOCKS_CLK_ADC_CTRL_ENABLED_RESET, 0x0
.equ	CLOCKS_CLK_ADC_CTRL_ENABLED_BITS, 0x10000000
.equ	CLOCKS_CLK_ADC_CTRL_ENABLED_MSB, 28
.equ	CLOCKS_CLK_ADC_CTRL_ENABLED_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_ADC_CTRL_NUDGE
# Description : An edge on this signal shifts the phase of the output by 1
#               cycle of the input clock
#               This can be done at any time
.equ	CLOCKS_CLK_ADC_CTRL_NUDGE_RESET, 0x0
.equ	CLOCKS_CLK_ADC_CTRL_NUDGE_BITS, 0x00100000
.equ	CLOCKS_CLK_ADC_CTRL_NUDGE_MSB, 20
.equ	CLOCKS_CLK_ADC_CTRL_NUDGE_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_ADC_CTRL_PHASE
# Description : This delays the enable signal by up to 3 cycles of the input
#               clock
#               This must be set before the clock is enabled to have any effect
.equ	CLOCKS_CLK_ADC_CTRL_PHASE_RESET, 0x0
.equ	CLOCKS_CLK_ADC_CTRL_PHASE_BITS, 0x00030000
.equ	CLOCKS_CLK_ADC_CTRL_PHASE_MSB, 17
.equ	CLOCKS_CLK_ADC_CTRL_PHASE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_ADC_CTRL_ENABLE
# Description : Starts and stops the clock generator cleanly
.equ	CLOCKS_CLK_ADC_CTRL_ENABLE_RESET, 0x0
.equ	CLOCKS_CLK_ADC_CTRL_ENABLE_BITS, 0x00000800
.equ	CLOCKS_CLK_ADC_CTRL_ENABLE_MSB, 11
.equ	CLOCKS_CLK_ADC_CTRL_ENABLE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_ADC_CTRL_KILL
# Description : Asynchronously kills the clock generator, enable must be set
#               low before deasserting kill
.equ	CLOCKS_CLK_ADC_CTRL_KILL_RESET, 0x0
.equ	CLOCKS_CLK_ADC_CTRL_KILL_BITS, 0x00000400
.equ	CLOCKS_CLK_ADC_CTRL_KILL_MSB, 10
.equ	CLOCKS_CLK_ADC_CTRL_KILL_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_ADC_CTRL_AUXSRC
# Description : Selects the auxiliary clock source, will glitch when switching
#               0x0 -> clksrc_pll_usb
#               0x1 -> clksrc_pll_sys
#               0x2 -> rosc_clksrc_ph
