konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/clocks.inc
#               0x3 -> xosc_clksrc
#               0x4 -> clksrc_gpin0
#               0x5 -> clksrc_gpin1
.equ	CLOCKS_CLK_ADC_CTRL_AUXSRC_RESET, 0x0
.equ	CLOCKS_CLK_ADC_CTRL_AUXSRC_BITS, 0x000000e0
.equ	CLOCKS_CLK_ADC_CTRL_AUXSRC_MSB, 7
.equ	CLOCKS_CLK_ADC_CTRL_AUXSRC_LSB, 5
.equ	CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB, 0x0
.equ	CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS, 0x1
.equ	CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH, 0x2
.equ	CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_XOSC_CLKSRC, 0x3
.equ	CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0, 0x4
.equ	CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1, 0x5
# =============================================================================
# Register    : CLOCKS_CLK_ADC_DIV
.equ	CLOCKS_CLK_ADC_DIV_OFFSET, 0x00000070
.equ	CLOCKS_CLK_ADC_DIV_BITS, 0x000f0000
.equ	CLOCKS_CLK_ADC_DIV_RESET, 0x00010000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_ADC_DIV_INT
# Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
#               the-fly
.equ	CLOCKS_CLK_ADC_DIV_INT_RESET, 0x1
.equ	CLOCKS_CLK_ADC_DIV_INT_BITS, 0x000f0000
.equ	CLOCKS_CLK_ADC_DIV_INT_MSB, 19
.equ	CLOCKS_CLK_ADC_DIV_INT_LSB, 16
# =============================================================================
# Register    : CLOCKS_CLK_ADC_SELECTED
# Description : Indicates which src is currently selected (one-hot)
#               This slice does not have a glitchless mux (only the AUX_SRC
#               field is present, not SRC) so this register is hardwired to
#               0x1.
.equ	CLOCKS_CLK_ADC_SELECTED_OFFSET, 0x00000074
.equ	CLOCKS_CLK_ADC_SELECTED_BITS, 0x00000001
.equ	CLOCKS_CLK_ADC_SELECTED_RESET, 0x00000001
.equ	CLOCKS_CLK_ADC_SELECTED_MSB, 0
.equ	CLOCKS_CLK_ADC_SELECTED_LSB, 0
# =============================================================================
# Register    : CLOCKS_DFTCLK_XOSC_CTRL
.equ	CLOCKS_DFTCLK_XOSC_CTRL_OFFSET, 0x00000078
.equ	CLOCKS_DFTCLK_XOSC_CTRL_BITS, 0x00000003
.equ	CLOCKS_DFTCLK_XOSC_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_DFTCLK_XOSC_CTRL_SRC
#               0x0 -> NULL
#               0x1 -> clksrc_pll_usb_primary
#               0x2 -> clksrc_gpin0
.equ	CLOCKS_DFTCLK_XOSC_CTRL_SRC_RESET, 0x0
.equ	CLOCKS_DFTCLK_XOSC_CTRL_SRC_BITS, 0x00000003
.equ	CLOCKS_DFTCLK_XOSC_CTRL_SRC_MSB, 1
.equ	CLOCKS_DFTCLK_XOSC_CTRL_SRC_LSB, 0
.equ	CLOCKS_DFTCLK_XOSC_CTRL_SRC_VALUE_NULL, 0x0
.equ	CLOCKS_DFTCLK_XOSC_CTRL_SRC_VALUE_CLKSRC_PLL_USB_PRIMARY, 0x1
.equ	CLOCKS_DFTCLK_XOSC_CTRL_SRC_VALUE_CLKSRC_GPIN0, 0x2
# =============================================================================
# Register    : CLOCKS_DFTCLK_ROSC_CTRL
.equ	CLOCKS_DFTCLK_ROSC_CTRL_OFFSET, 0x0000007c
.equ	CLOCKS_DFTCLK_ROSC_CTRL_BITS, 0x00000003
.equ	CLOCKS_DFTCLK_ROSC_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_DFTCLK_ROSC_CTRL_SRC
#               0x0 -> NULL
#               0x1 -> clksrc_pll_sys_primary_rosc
#               0x2 -> clksrc_gpin1
.equ	CLOCKS_DFTCLK_ROSC_CTRL_SRC_RESET, 0x0
.equ	CLOCKS_DFTCLK_ROSC_CTRL_SRC_BITS, 0x00000003
.equ	CLOCKS_DFTCLK_ROSC_CTRL_SRC_MSB, 1
.equ	CLOCKS_DFTCLK_ROSC_CTRL_SRC_LSB, 0
.equ	CLOCKS_DFTCLK_ROSC_CTRL_SRC_VALUE_NULL, 0x0
.equ	CLOCKS_DFTCLK_ROSC_CTRL_SRC_VALUE_CLKSRC_PLL_SYS_PRIMARY_ROSC, 0x1
.equ	CLOCKS_DFTCLK_ROSC_CTRL_SRC_VALUE_CLKSRC_GPIN1, 0x2
# =============================================================================
# Register    : CLOCKS_DFTCLK_LPOSC_CTRL
.equ	CLOCKS_DFTCLK_LPOSC_CTRL_OFFSET, 0x00000080
.equ	CLOCKS_DFTCLK_LPOSC_CTRL_BITS, 0x00000003
.equ	CLOCKS_DFTCLK_LPOSC_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_DFTCLK_LPOSC_CTRL_SRC
#               0x0 -> NULL
#               0x1 -> clksrc_pll_usb_primary_lposc
#               0x2 -> clksrc_gpin1
.equ	CLOCKS_DFTCLK_LPOSC_CTRL_SRC_RESET, 0x0
.equ	CLOCKS_DFTCLK_LPOSC_CTRL_SRC_BITS, 0x00000003
.equ	CLOCKS_DFTCLK_LPOSC_CTRL_SRC_MSB, 1
.equ	CLOCKS_DFTCLK_LPOSC_CTRL_SRC_LSB, 0
.equ	CLOCKS_DFTCLK_LPOSC_CTRL_SRC_VALUE_NULL, 0x0
.equ	CLOCKS_DFTCLK_LPOSC_CTRL_SRC_VALUE_CLKSRC_PLL_USB_PRIMARY_LPOSC, 0x1
.equ	CLOCKS_DFTCLK_LPOSC_CTRL_SRC_VALUE_CLKSRC_GPIN1, 0x2
# =============================================================================
# Register    : CLOCKS_CLK_SYS_RESUS_CTRL
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_OFFSET, 0x00000084
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_BITS, 0x000111ff
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_RESET, 0x000000ff
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR
# Description : For clearing the resus after the fault that triggered it has
#               been corrected
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_RESET, 0x0
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_BITS, 0x00010000
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_MSB, 16
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_SYS_RESUS_CTRL_FRCE
# Description : Force a resus, for test purposes only
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_RESET, 0x0
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_BITS, 0x00001000
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_MSB, 12
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_LSB, 12
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE
# Description : Enable resus
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_RESET, 0x0
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_BITS, 0x00000100
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_MSB, 8
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_LSB, 8
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT
# Description : This is expressed as a number of clk_ref cycles
#               and must be >= 2x clk_ref_freq/min_clk_tst_freq
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_RESET, 0xff
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_BITS, 0x000000ff
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_MSB, 7
.equ	CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_LSB, 0
# =============================================================================
# Register    : CLOCKS_CLK_SYS_RESUS_STATUS
.equ	CLOCKS_CLK_SYS_RESUS_STATUS_OFFSET, 0x00000088
.equ	CLOCKS_CLK_SYS_RESUS_STATUS_BITS, 0x00000001
.equ	CLOCKS_CLK_SYS_RESUS_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED
# Description : Clock has been resuscitated, correct the error then send
#               ctrl_clear=1
.equ	CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_RESET, 0x0
.equ	CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_BITS, 0x00000001
.equ	CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_MSB, 0
.equ	CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_LSB, 0
# =============================================================================
# Register    : CLOCKS_FC0_REF_KHZ
# Description : Reference clock frequency in kHz
.equ	CLOCKS_FC0_REF_KHZ_OFFSET, 0x0000008c
.equ	CLOCKS_FC0_REF_KHZ_BITS, 0x000fffff
.equ	CLOCKS_FC0_REF_KHZ_RESET, 0x00000000
.equ	CLOCKS_FC0_REF_KHZ_MSB, 19
.equ	CLOCKS_FC0_REF_KHZ_LSB, 0
# =============================================================================
# Register    : CLOCKS_FC0_MIN_KHZ
# Description : Minimum pass frequency in kHz. This is optional. Set to 0 if
#               you are not using the pass/fail flags
.equ	CLOCKS_FC0_MIN_KHZ_OFFSET, 0x00000090
.equ	CLOCKS_FC0_MIN_KHZ_BITS, 0x01ffffff
.equ	CLOCKS_FC0_MIN_KHZ_RESET, 0x00000000
.equ	CLOCKS_FC0_MIN_KHZ_MSB, 24
.equ	CLOCKS_FC0_MIN_KHZ_LSB, 0
# =============================================================================
# Register    : CLOCKS_FC0_MAX_KHZ
# Description : Maximum pass frequency in kHz. This is optional. Set to
#               0x1ffffff if you are not using the pass/fail flags
.equ	CLOCKS_FC0_MAX_KHZ_OFFSET, 0x00000094
.equ	CLOCKS_FC0_MAX_KHZ_BITS, 0x01ffffff
.equ	CLOCKS_FC0_MAX_KHZ_RESET, 0x01ffffff
.equ	CLOCKS_FC0_MAX_KHZ_MSB, 24
.equ	CLOCKS_FC0_MAX_KHZ_LSB, 0
# =============================================================================
# Register    : CLOCKS_FC0_DELAY
# Description : Delays the start of frequency counting to allow the mux to
#               settle
#               Delay is measured in multiples of the reference clock period
.equ	CLOCKS_FC0_DELAY_OFFSET, 0x00000098
.equ	CLOCKS_FC0_DELAY_BITS, 0x00000007
.equ	CLOCKS_FC0_DELAY_RESET, 0x00000001
.equ	CLOCKS_FC0_DELAY_MSB, 2
.equ	CLOCKS_FC0_DELAY_LSB, 0
# =============================================================================
# Register    : CLOCKS_FC0_INTERVAL
# Description : The test interval is 0.98us * 2**interval, but let's call it
#               1us * 2**interval
#               The default gives a test interval of 250us
.equ	CLOCKS_FC0_INTERVAL_OFFSET, 0x0000009c
.equ	CLOCKS_FC0_INTERVAL_BITS, 0x0000000f
.equ	CLOCKS_FC0_INTERVAL_RESET, 0x00000008
.equ	CLOCKS_FC0_INTERVAL_MSB, 3
.equ	CLOCKS_FC0_INTERVAL_LSB, 0
# =============================================================================
# Register    : CLOCKS_FC0_SRC
# Description : Clock sent to frequency counter, set to 0 when not required
#               Writing to this register initiates the frequency count
#               0x00 -> NULL
#               0x01 -> pll_sys_clksrc_primary
#               0x02 -> pll_usb_clksrc_primary
#               0x03 -> rosc_clksrc
#               0x04 -> rosc_clksrc_ph
#               0x05 -> xosc_clksrc
#               0x06 -> clksrc_gpin0
#               0x07 -> clksrc_gpin1
#               0x08 -> clk_ref
#               0x09 -> clk_sys
#               0x0a -> clk_peri
#               0x0b -> clk_usb
#               0x0c -> clk_adc
#               0x0d -> clk_hstx
#               0x0e -> lposc_clksrc
#               0x0f -> otp_clk2fc
#               0x10 -> pll_usb_clksrc_primary_dft
.equ	CLOCKS_FC0_SRC_OFFSET, 0x000000a0
.equ	CLOCKS_FC0_SRC_BITS, 0x000000ff
.equ	CLOCKS_FC0_SRC_RESET, 0x00000000
.equ	CLOCKS_FC0_SRC_MSB, 7
.equ	CLOCKS_FC0_SRC_LSB, 0
.equ	CLOCKS_FC0_SRC_VALUE_NULL, 0x00
.equ	CLOCKS_FC0_SRC_VALUE_PLL_SYS_CLKSRC_PRIMARY, 0x01
.equ	CLOCKS_FC0_SRC_VALUE_PLL_USB_CLKSRC_PRIMARY, 0x02
.equ	CLOCKS_FC0_SRC_VALUE_ROSC_CLKSRC, 0x03
.equ	CLOCKS_FC0_SRC_VALUE_ROSC_CLKSRC_PH, 0x04
.equ	CLOCKS_FC0_SRC_VALUE_XOSC_CLKSRC, 0x05
.equ	CLOCKS_FC0_SRC_VALUE_CLKSRC_GPIN0, 0x06
.equ	CLOCKS_FC0_SRC_VALUE_CLKSRC_GPIN1, 0x07
.equ	CLOCKS_FC0_SRC_VALUE_CLK_REF, 0x08
.equ	CLOCKS_FC0_SRC_VALUE_CLK_SYS, 0x09
.equ	CLOCKS_FC0_SRC_VALUE_CLK_PERI, 0x0a
.equ	CLOCKS_FC0_SRC_VALUE_CLK_USB, 0x0b
.equ	CLOCKS_FC0_SRC_VALUE_CLK_ADC, 0x0c
.equ	CLOCKS_FC0_SRC_VALUE_CLK_HSTX, 0x0d
.equ	CLOCKS_FC0_SRC_VALUE_LPOSC_CLKSRC, 0x0e
.equ	CLOCKS_FC0_SRC_VALUE_OTP_CLK2FC, 0x0f
.equ	CLOCKS_FC0_SRC_VALUE_PLL_USB_CLKSRC_PRIMARY_DFT, 0x10
# =============================================================================
# Register    : CLOCKS_FC0_STATUS
# Description : Frequency counter status
.equ	CLOCKS_FC0_STATUS_OFFSET, 0x000000a4
.equ	CLOCKS_FC0_STATUS_BITS, 0x11111111
.equ	CLOCKS_FC0_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_FC0_STATUS_DIED
# Description : Test clock stopped during test
.equ	CLOCKS_FC0_STATUS_DIED_RESET, 0x0
.equ	CLOCKS_FC0_STATUS_DIED_BITS, 0x10000000
.equ	CLOCKS_FC0_STATUS_DIED_MSB, 28
.equ	CLOCKS_FC0_STATUS_DIED_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_FC0_STATUS_FAST
# Description : Test clock faster than expected, only valid when status_done=1
.equ	CLOCKS_FC0_STATUS_FAST_RESET, 0x0
.equ	CLOCKS_FC0_STATUS_FAST_BITS, 0x01000000
.equ	CLOCKS_FC0_STATUS_FAST_MSB, 24
.equ	CLOCKS_FC0_STATUS_FAST_LSB, 24
# -----------------------------------------------------------------------------
# Field       : CLOCKS_FC0_STATUS_SLOW
# Description : Test clock slower than expected, only valid when status_done=1
.equ	CLOCKS_FC0_STATUS_SLOW_RESET, 0x0
.equ	CLOCKS_FC0_STATUS_SLOW_BITS, 0x00100000
.equ	CLOCKS_FC0_STATUS_SLOW_MSB, 20
.equ	CLOCKS_FC0_STATUS_SLOW_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_FC0_STATUS_FAIL
# Description : Test failed
.equ	CLOCKS_FC0_STATUS_FAIL_RESET, 0x0
.equ	CLOCKS_FC0_STATUS_FAIL_BITS, 0x00010000
.equ	CLOCKS_FC0_STATUS_FAIL_MSB, 16
.equ	CLOCKS_FC0_STATUS_FAIL_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_FC0_STATUS_WAITING
# Description : Waiting for test clock to start
.equ	CLOCKS_FC0_STATUS_WAITING_RESET, 0x0
.equ	CLOCKS_FC0_STATUS_WAITING_BITS, 0x00001000
.equ	CLOCKS_FC0_STATUS_WAITING_MSB, 12
.equ	CLOCKS_FC0_STATUS_WAITING_LSB, 12
# -----------------------------------------------------------------------------
# Field       : CLOCKS_FC0_STATUS_RUNNING
# Description : Test running
.equ	CLOCKS_FC0_STATUS_RUNNING_RESET, 0x0
.equ	CLOCKS_FC0_STATUS_RUNNING_BITS, 0x00000100
.equ	CLOCKS_FC0_STATUS_RUNNING_MSB, 8
.equ	CLOCKS_FC0_STATUS_RUNNING_LSB, 8
# -----------------------------------------------------------------------------
# Field       : CLOCKS_FC0_STATUS_DONE
# Description : Test complete
.equ	CLOCKS_FC0_STATUS_DONE_RESET, 0x0
.equ	CLOCKS_FC0_STATUS_DONE_BITS, 0x00000010
.equ	CLOCKS_FC0_STATUS_DONE_MSB, 4
.equ	CLOCKS_FC0_STATUS_DONE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : CLOCKS_FC0_STATUS_PASS
# Description : Test passed
.equ	CLOCKS_FC0_STATUS_PASS_RESET, 0x0
.equ	CLOCKS_FC0_STATUS_PASS_BITS, 0x00000001
.equ	CLOCKS_FC0_STATUS_PASS_MSB, 0
.equ	CLOCKS_FC0_STATUS_PASS_LSB, 0
# =============================================================================
# Register    : CLOCKS_FC0_RESULT
# Description : Result of frequency measurement, only valid when status_done=1
.equ	CLOCKS_FC0_RESULT_OFFSET, 0x000000a8
.equ	CLOCKS_FC0_RESULT_BITS, 0x3fffffff
.equ	CLOCKS_FC0_RESULT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_FC0_RESULT_KHZ
.equ	CLOCKS_FC0_RESULT_KHZ_RESET, 0x0000000
.equ	CLOCKS_FC0_RESULT_KHZ_BITS, 0x3fffffe0
.equ	CLOCKS_FC0_RESULT_KHZ_MSB, 29
.equ	CLOCKS_FC0_RESULT_KHZ_LSB, 5
# -----------------------------------------------------------------------------
# Field       : CLOCKS_FC0_RESULT_FRAC
.equ	CLOCKS_FC0_RESULT_FRAC_RESET, 0x00
.equ	CLOCKS_FC0_RESULT_FRAC_BITS, 0x0000001f
.equ	CLOCKS_FC0_RESULT_FRAC_MSB, 4
.equ	CLOCKS_FC0_RESULT_FRAC_LSB, 0
# =============================================================================
# Register    : CLOCKS_WAKE_EN0
# Description : enable clock in wake mode
.equ	CLOCKS_WAKE_EN0_OFFSET, 0x000000ac
.equ	CLOCKS_WAKE_EN0_BITS, 0xffffffff
.equ	CLOCKS_WAKE_EN0_RESET, 0xffffffff
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_SIO
.equ	CLOCKS_WAKE_EN0_CLK_SYS_SIO_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_SIO_BITS, 0x80000000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_SIO_MSB, 31
.equ	CLOCKS_WAKE_EN0_CLK_SYS_SIO_LSB, 31
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_SHA256
.equ	CLOCKS_WAKE_EN0_CLK_SYS_SHA256_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_SHA256_BITS, 0x40000000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_SHA256_MSB, 30
.equ	CLOCKS_WAKE_EN0_CLK_SYS_SHA256_LSB, 30
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_PSM
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PSM_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PSM_BITS, 0x20000000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PSM_MSB, 29
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PSM_LSB, 29
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_ROSC
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ROSC_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ROSC_BITS, 0x10000000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ROSC_MSB, 28
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ROSC_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_ROM
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ROM_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ROM_BITS, 0x08000000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ROM_MSB, 27
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ROM_LSB, 27
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_RESETS
.equ	CLOCKS_WAKE_EN0_CLK_SYS_RESETS_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_RESETS_BITS, 0x04000000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_RESETS_MSB, 26
.equ	CLOCKS_WAKE_EN0_CLK_SYS_RESETS_LSB, 26
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_PWM
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PWM_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PWM_BITS, 0x02000000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PWM_MSB, 25
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PWM_LSB, 25
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_POWMAN
.equ	CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_BITS, 0x01000000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_MSB, 24
.equ	CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_LSB, 24
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_REF_POWMAN
.equ	CLOCKS_WAKE_EN0_CLK_REF_POWMAN_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_REF_POWMAN_BITS, 0x00800000
.equ	CLOCKS_WAKE_EN0_CLK_REF_POWMAN_MSB, 23
.equ	CLOCKS_WAKE_EN0_CLK_REF_POWMAN_LSB, 23
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_BITS, 0x00400000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_MSB, 22
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_LSB, 22
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_BITS, 0x00200000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_MSB, 21
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_LSB, 21
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_PIO2
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO2_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO2_BITS, 0x00100000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO2_MSB, 20
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_PIO1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO1_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO1_BITS, 0x00080000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO1_MSB, 19
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO1_LSB, 19
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_PIO0
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO0_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO0_BITS, 0x00040000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO0_MSB, 18
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PIO0_LSB, 18
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_PADS
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PADS_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PADS_BITS, 0x00020000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PADS_MSB, 17
.equ	CLOCKS_WAKE_EN0_CLK_SYS_PADS_LSB, 17
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_OTP
.equ	CLOCKS_WAKE_EN0_CLK_SYS_OTP_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_OTP_BITS, 0x00010000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_OTP_MSB, 16
.equ	CLOCKS_WAKE_EN0_CLK_SYS_OTP_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_REF_OTP
.equ	CLOCKS_WAKE_EN0_CLK_REF_OTP_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_REF_OTP_BITS, 0x00008000
.equ	CLOCKS_WAKE_EN0_CLK_REF_OTP_MSB, 15
.equ	CLOCKS_WAKE_EN0_CLK_REF_OTP_LSB, 15
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_JTAG
.equ	CLOCKS_WAKE_EN0_CLK_SYS_JTAG_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_JTAG_BITS, 0x00004000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_JTAG_MSB, 14
.equ	CLOCKS_WAKE_EN0_CLK_SYS_JTAG_LSB, 14
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_IO
.equ	CLOCKS_WAKE_EN0_CLK_SYS_IO_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_IO_BITS, 0x00002000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_IO_MSB, 13
.equ	CLOCKS_WAKE_EN0_CLK_SYS_IO_LSB, 13
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_I2C1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_I2C1_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_I2C1_BITS, 0x00001000
.equ	CLOCKS_WAKE_EN0_CLK_SYS_I2C1_MSB, 12
.equ	CLOCKS_WAKE_EN0_CLK_SYS_I2C1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_I2C0
.equ	CLOCKS_WAKE_EN0_CLK_SYS_I2C0_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_I2C0_BITS, 0x00000800
.equ	CLOCKS_WAKE_EN0_CLK_SYS_I2C0_MSB, 11
.equ	CLOCKS_WAKE_EN0_CLK_SYS_I2C0_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_HSTX
.equ	CLOCKS_WAKE_EN0_CLK_SYS_HSTX_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_HSTX_BITS, 0x00000400
.equ	CLOCKS_WAKE_EN0_CLK_SYS_HSTX_MSB, 10
.equ	CLOCKS_WAKE_EN0_CLK_SYS_HSTX_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_HSTX
.equ	CLOCKS_WAKE_EN0_CLK_HSTX_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_HSTX_BITS, 0x00000200
.equ	CLOCKS_WAKE_EN0_CLK_HSTX_MSB, 9
.equ	CLOCKS_WAKE_EN0_CLK_HSTX_LSB, 9
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR
.equ	CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_BITS, 0x00000100
.equ	CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_MSB, 8
.equ	CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_LSB, 8
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_DMA
.equ	CLOCKS_WAKE_EN0_CLK_SYS_DMA_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_DMA_BITS, 0x00000080
.equ	CLOCKS_WAKE_EN0_CLK_SYS_DMA_MSB, 7
.equ	CLOCKS_WAKE_EN0_CLK_SYS_DMA_LSB, 7
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_BITS, 0x00000040
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_MSB, 6
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_LSB, 6
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_BITS, 0x00000020
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_MSB, 5
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_LSB, 5
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_BITS, 0x00000010
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_MSB, 4
.equ	CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_LSB, 4
# -----------------------------------------------------------------------------
# Field       : CLOCKS_WAKE_EN0_CLK_SYS_ADC
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ADC_RESET, 0x1
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ADC_BITS, 0x00000008
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ADC_MSB, 3
.equ	CLOCKS_WAKE_EN0_CLK_SYS_ADC_LSB, 3
# -----------------------------------------------------------------------------
