konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/clocks.inc
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_UART0_BITS, 0x00400000
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_UART0_MSB, 22
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_UART0_LSB, 22
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_TRNG
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TRNG_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TRNG_BITS, 0x00200000
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TRNG_MSB, 21
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TRNG_LSB, 21
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_TIMER1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TIMER1_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TIMER1_BITS, 0x00100000
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TIMER1_MSB, 20
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TIMER1_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_TIMER0
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TIMER0_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TIMER0_BITS, 0x00080000
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TIMER0_MSB, 19
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TIMER0_LSB, 19
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_TICKS
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TICKS_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TICKS_BITS, 0x00040000
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TICKS_MSB, 18
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TICKS_LSB, 18
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_REF_TICKS
.equ	CLOCKS_SLEEP_EN1_CLK_REF_TICKS_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_REF_TICKS_BITS, 0x00020000
.equ	CLOCKS_SLEEP_EN1_CLK_REF_TICKS_MSB, 17
.equ	CLOCKS_SLEEP_EN1_CLK_REF_TICKS_LSB, 17
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_BITS, 0x00010000
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_MSB, 16
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_TBMAN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_BITS, 0x00008000
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_MSB, 15
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SYSINFO_LSB, 15
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_BITS, 0x00004000
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_MSB, 14
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SYSCFG_LSB, 14
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM9
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM9_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM9_BITS, 0x00002000
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM9_MSB, 13
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM9_LSB, 13
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM8
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM8_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM8_BITS, 0x00001000
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM8_MSB, 12
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM8_LSB, 12
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM7
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM7_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM7_BITS, 0x00000800
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM7_MSB, 11
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM7_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM6
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM6_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM6_BITS, 0x00000400
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM6_MSB, 10
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM6_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_BITS, 0x00000200
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_MSB, 9
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM5_LSB, 9
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_BITS, 0x00000100
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_MSB, 8
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM4_LSB, 8
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM3
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM3_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM3_BITS, 0x00000080
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM3_MSB, 7
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM3_LSB, 7
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM2
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM2_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM2_BITS, 0x00000040
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM2_MSB, 6
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM2_LSB, 6
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM1_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM1_BITS, 0x00000020
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM1_MSB, 5
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SRAM0
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM0_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM0_BITS, 0x00000010
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM0_MSB, 4
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SRAM0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SPI1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SPI1_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SPI1_BITS, 0x00000008
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SPI1_MSB, 3
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SPI1_LSB, 3
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_PERI_SPI1
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_SPI1_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_SPI1_BITS, 0x00000004
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_SPI1_MSB, 2
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_SPI1_LSB, 2
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_SYS_SPI0
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SPI0_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SPI0_BITS, 0x00000002
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SPI0_MSB, 1
.equ	CLOCKS_SLEEP_EN1_CLK_SYS_SPI0_LSB, 1
# -----------------------------------------------------------------------------
# Field       : CLOCKS_SLEEP_EN1_CLK_PERI_SPI0
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_SPI0_RESET, 0x1
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_SPI0_BITS, 0x00000001
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_SPI0_MSB, 0
.equ	CLOCKS_SLEEP_EN1_CLK_PERI_SPI0_LSB, 0
# =============================================================================
# Register    : CLOCKS_ENABLED0
# Description : indicates the state of the clock enable
.equ	CLOCKS_ENABLED0_OFFSET, 0x000000bc
.equ	CLOCKS_ENABLED0_BITS, 0xffffffff
.equ	CLOCKS_ENABLED0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_SIO
.equ	CLOCKS_ENABLED0_CLK_SYS_SIO_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_SIO_BITS, 0x80000000
.equ	CLOCKS_ENABLED0_CLK_SYS_SIO_MSB, 31
.equ	CLOCKS_ENABLED0_CLK_SYS_SIO_LSB, 31
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_SHA256
.equ	CLOCKS_ENABLED0_CLK_SYS_SHA256_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_SHA256_BITS, 0x40000000
.equ	CLOCKS_ENABLED0_CLK_SYS_SHA256_MSB, 30
.equ	CLOCKS_ENABLED0_CLK_SYS_SHA256_LSB, 30
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_PSM
.equ	CLOCKS_ENABLED0_CLK_SYS_PSM_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_PSM_BITS, 0x20000000
.equ	CLOCKS_ENABLED0_CLK_SYS_PSM_MSB, 29
.equ	CLOCKS_ENABLED0_CLK_SYS_PSM_LSB, 29
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_ROSC
.equ	CLOCKS_ENABLED0_CLK_SYS_ROSC_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_ROSC_BITS, 0x10000000
.equ	CLOCKS_ENABLED0_CLK_SYS_ROSC_MSB, 28
.equ	CLOCKS_ENABLED0_CLK_SYS_ROSC_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_ROM
.equ	CLOCKS_ENABLED0_CLK_SYS_ROM_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_ROM_BITS, 0x08000000
.equ	CLOCKS_ENABLED0_CLK_SYS_ROM_MSB, 27
.equ	CLOCKS_ENABLED0_CLK_SYS_ROM_LSB, 27
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_RESETS
.equ	CLOCKS_ENABLED0_CLK_SYS_RESETS_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_RESETS_BITS, 0x04000000
.equ	CLOCKS_ENABLED0_CLK_SYS_RESETS_MSB, 26
.equ	CLOCKS_ENABLED0_CLK_SYS_RESETS_LSB, 26
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_PWM
.equ	CLOCKS_ENABLED0_CLK_SYS_PWM_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_PWM_BITS, 0x02000000
.equ	CLOCKS_ENABLED0_CLK_SYS_PWM_MSB, 25
.equ	CLOCKS_ENABLED0_CLK_SYS_PWM_LSB, 25
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_POWMAN
.equ	CLOCKS_ENABLED0_CLK_SYS_POWMAN_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_POWMAN_BITS, 0x01000000
.equ	CLOCKS_ENABLED0_CLK_SYS_POWMAN_MSB, 24
.equ	CLOCKS_ENABLED0_CLK_SYS_POWMAN_LSB, 24
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_REF_POWMAN
.equ	CLOCKS_ENABLED0_CLK_REF_POWMAN_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_REF_POWMAN_BITS, 0x00800000
.equ	CLOCKS_ENABLED0_CLK_REF_POWMAN_MSB, 23
.equ	CLOCKS_ENABLED0_CLK_REF_POWMAN_LSB, 23
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_PLL_USB
.equ	CLOCKS_ENABLED0_CLK_SYS_PLL_USB_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_PLL_USB_BITS, 0x00400000
.equ	CLOCKS_ENABLED0_CLK_SYS_PLL_USB_MSB, 22
.equ	CLOCKS_ENABLED0_CLK_SYS_PLL_USB_LSB, 22
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_PLL_SYS
.equ	CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_BITS, 0x00200000
.equ	CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_MSB, 21
.equ	CLOCKS_ENABLED0_CLK_SYS_PLL_SYS_LSB, 21
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_PIO2
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO2_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO2_BITS, 0x00100000
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO2_MSB, 20
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_PIO1
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO1_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO1_BITS, 0x00080000
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO1_MSB, 19
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO1_LSB, 19
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_PIO0
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO0_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO0_BITS, 0x00040000
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO0_MSB, 18
.equ	CLOCKS_ENABLED0_CLK_SYS_PIO0_LSB, 18
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_PADS
.equ	CLOCKS_ENABLED0_CLK_SYS_PADS_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_PADS_BITS, 0x00020000
.equ	CLOCKS_ENABLED0_CLK_SYS_PADS_MSB, 17
.equ	CLOCKS_ENABLED0_CLK_SYS_PADS_LSB, 17
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_OTP
.equ	CLOCKS_ENABLED0_CLK_SYS_OTP_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_OTP_BITS, 0x00010000
.equ	CLOCKS_ENABLED0_CLK_SYS_OTP_MSB, 16
.equ	CLOCKS_ENABLED0_CLK_SYS_OTP_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_REF_OTP
.equ	CLOCKS_ENABLED0_CLK_REF_OTP_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_REF_OTP_BITS, 0x00008000
.equ	CLOCKS_ENABLED0_CLK_REF_OTP_MSB, 15
.equ	CLOCKS_ENABLED0_CLK_REF_OTP_LSB, 15
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_JTAG
.equ	CLOCKS_ENABLED0_CLK_SYS_JTAG_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_JTAG_BITS, 0x00004000
.equ	CLOCKS_ENABLED0_CLK_SYS_JTAG_MSB, 14
.equ	CLOCKS_ENABLED0_CLK_SYS_JTAG_LSB, 14
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_IO
.equ	CLOCKS_ENABLED0_CLK_SYS_IO_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_IO_BITS, 0x00002000
.equ	CLOCKS_ENABLED0_CLK_SYS_IO_MSB, 13
.equ	CLOCKS_ENABLED0_CLK_SYS_IO_LSB, 13
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_I2C1
.equ	CLOCKS_ENABLED0_CLK_SYS_I2C1_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_I2C1_BITS, 0x00001000
.equ	CLOCKS_ENABLED0_CLK_SYS_I2C1_MSB, 12
.equ	CLOCKS_ENABLED0_CLK_SYS_I2C1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_I2C0
.equ	CLOCKS_ENABLED0_CLK_SYS_I2C0_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_I2C0_BITS, 0x00000800
.equ	CLOCKS_ENABLED0_CLK_SYS_I2C0_MSB, 11
.equ	CLOCKS_ENABLED0_CLK_SYS_I2C0_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_HSTX
.equ	CLOCKS_ENABLED0_CLK_SYS_HSTX_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_HSTX_BITS, 0x00000400
.equ	CLOCKS_ENABLED0_CLK_SYS_HSTX_MSB, 10
.equ	CLOCKS_ENABLED0_CLK_SYS_HSTX_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_HSTX
.equ	CLOCKS_ENABLED0_CLK_HSTX_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_HSTX_BITS, 0x00000200
.equ	CLOCKS_ENABLED0_CLK_HSTX_MSB, 9
.equ	CLOCKS_ENABLED0_CLK_HSTX_LSB, 9
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_GLITCH_DETECTOR
.equ	CLOCKS_ENABLED0_CLK_SYS_GLITCH_DETECTOR_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_GLITCH_DETECTOR_BITS, 0x00000100
.equ	CLOCKS_ENABLED0_CLK_SYS_GLITCH_DETECTOR_MSB, 8
.equ	CLOCKS_ENABLED0_CLK_SYS_GLITCH_DETECTOR_LSB, 8
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_DMA
.equ	CLOCKS_ENABLED0_CLK_SYS_DMA_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_DMA_BITS, 0x00000080
.equ	CLOCKS_ENABLED0_CLK_SYS_DMA_MSB, 7
.equ	CLOCKS_ENABLED0_CLK_SYS_DMA_LSB, 7
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC
.equ	CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_BITS, 0x00000040
.equ	CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_MSB, 6
.equ	CLOCKS_ENABLED0_CLK_SYS_BUSFABRIC_LSB, 6
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_BUSCTRL
.equ	CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_BITS, 0x00000020
.equ	CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_MSB, 5
.equ	CLOCKS_ENABLED0_CLK_SYS_BUSCTRL_LSB, 5
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_BOOTRAM
.equ	CLOCKS_ENABLED0_CLK_SYS_BOOTRAM_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_BOOTRAM_BITS, 0x00000010
.equ	CLOCKS_ENABLED0_CLK_SYS_BOOTRAM_MSB, 4
.equ	CLOCKS_ENABLED0_CLK_SYS_BOOTRAM_LSB, 4
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_ADC
.equ	CLOCKS_ENABLED0_CLK_SYS_ADC_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_ADC_BITS, 0x00000008
.equ	CLOCKS_ENABLED0_CLK_SYS_ADC_MSB, 3
.equ	CLOCKS_ENABLED0_CLK_SYS_ADC_LSB, 3
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_ADC
.equ	CLOCKS_ENABLED0_CLK_ADC_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_ADC_BITS, 0x00000004
.equ	CLOCKS_ENABLED0_CLK_ADC_MSB, 2
.equ	CLOCKS_ENABLED0_CLK_ADC_LSB, 2
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_ACCESSCTRL
.equ	CLOCKS_ENABLED0_CLK_SYS_ACCESSCTRL_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_ACCESSCTRL_BITS, 0x00000002
.equ	CLOCKS_ENABLED0_CLK_SYS_ACCESSCTRL_MSB, 1
.equ	CLOCKS_ENABLED0_CLK_SYS_ACCESSCTRL_LSB, 1
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED0_CLK_SYS_CLOCKS
.equ	CLOCKS_ENABLED0_CLK_SYS_CLOCKS_RESET, 0x0
.equ	CLOCKS_ENABLED0_CLK_SYS_CLOCKS_BITS, 0x00000001
.equ	CLOCKS_ENABLED0_CLK_SYS_CLOCKS_MSB, 0
.equ	CLOCKS_ENABLED0_CLK_SYS_CLOCKS_LSB, 0
# =============================================================================
# Register    : CLOCKS_ENABLED1
# Description : indicates the state of the clock enable
.equ	CLOCKS_ENABLED1_OFFSET, 0x000000c0
.equ	CLOCKS_ENABLED1_BITS, 0x7fffffff
.equ	CLOCKS_ENABLED1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_XOSC
.equ	CLOCKS_ENABLED1_CLK_SYS_XOSC_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_XOSC_BITS, 0x40000000
.equ	CLOCKS_ENABLED1_CLK_SYS_XOSC_MSB, 30
.equ	CLOCKS_ENABLED1_CLK_SYS_XOSC_LSB, 30
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_XIP
.equ	CLOCKS_ENABLED1_CLK_SYS_XIP_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_XIP_BITS, 0x20000000
.equ	CLOCKS_ENABLED1_CLK_SYS_XIP_MSB, 29
.equ	CLOCKS_ENABLED1_CLK_SYS_XIP_LSB, 29
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_WATCHDOG
.equ	CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_BITS, 0x10000000
.equ	CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_MSB, 28
.equ	CLOCKS_ENABLED1_CLK_SYS_WATCHDOG_LSB, 28
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_USB
.equ	CLOCKS_ENABLED1_CLK_USB_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_USB_BITS, 0x08000000
.equ	CLOCKS_ENABLED1_CLK_USB_MSB, 27
.equ	CLOCKS_ENABLED1_CLK_USB_LSB, 27
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_USBCTRL
.equ	CLOCKS_ENABLED1_CLK_SYS_USBCTRL_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_USBCTRL_BITS, 0x04000000
.equ	CLOCKS_ENABLED1_CLK_SYS_USBCTRL_MSB, 26
.equ	CLOCKS_ENABLED1_CLK_SYS_USBCTRL_LSB, 26
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_UART1
.equ	CLOCKS_ENABLED1_CLK_SYS_UART1_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_UART1_BITS, 0x02000000
.equ	CLOCKS_ENABLED1_CLK_SYS_UART1_MSB, 25
.equ	CLOCKS_ENABLED1_CLK_SYS_UART1_LSB, 25
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_PERI_UART1
.equ	CLOCKS_ENABLED1_CLK_PERI_UART1_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_PERI_UART1_BITS, 0x01000000
.equ	CLOCKS_ENABLED1_CLK_PERI_UART1_MSB, 24
.equ	CLOCKS_ENABLED1_CLK_PERI_UART1_LSB, 24
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_UART0
.equ	CLOCKS_ENABLED1_CLK_SYS_UART0_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_UART0_BITS, 0x00800000
.equ	CLOCKS_ENABLED1_CLK_SYS_UART0_MSB, 23
.equ	CLOCKS_ENABLED1_CLK_SYS_UART0_LSB, 23
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_PERI_UART0
.equ	CLOCKS_ENABLED1_CLK_PERI_UART0_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_PERI_UART0_BITS, 0x00400000
.equ	CLOCKS_ENABLED1_CLK_PERI_UART0_MSB, 22
.equ	CLOCKS_ENABLED1_CLK_PERI_UART0_LSB, 22
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_TRNG
.equ	CLOCKS_ENABLED1_CLK_SYS_TRNG_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_TRNG_BITS, 0x00200000
.equ	CLOCKS_ENABLED1_CLK_SYS_TRNG_MSB, 21
.equ	CLOCKS_ENABLED1_CLK_SYS_TRNG_LSB, 21
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_TIMER1
.equ	CLOCKS_ENABLED1_CLK_SYS_TIMER1_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_TIMER1_BITS, 0x00100000
.equ	CLOCKS_ENABLED1_CLK_SYS_TIMER1_MSB, 20
.equ	CLOCKS_ENABLED1_CLK_SYS_TIMER1_LSB, 20
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_TIMER0
.equ	CLOCKS_ENABLED1_CLK_SYS_TIMER0_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_TIMER0_BITS, 0x00080000
.equ	CLOCKS_ENABLED1_CLK_SYS_TIMER0_MSB, 19
.equ	CLOCKS_ENABLED1_CLK_SYS_TIMER0_LSB, 19
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_TICKS
.equ	CLOCKS_ENABLED1_CLK_SYS_TICKS_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_TICKS_BITS, 0x00040000
.equ	CLOCKS_ENABLED1_CLK_SYS_TICKS_MSB, 18
.equ	CLOCKS_ENABLED1_CLK_SYS_TICKS_LSB, 18
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_REF_TICKS
.equ	CLOCKS_ENABLED1_CLK_REF_TICKS_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_REF_TICKS_BITS, 0x00020000
.equ	CLOCKS_ENABLED1_CLK_REF_TICKS_MSB, 17
.equ	CLOCKS_ENABLED1_CLK_REF_TICKS_LSB, 17
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_TBMAN
.equ	CLOCKS_ENABLED1_CLK_SYS_TBMAN_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_TBMAN_BITS, 0x00010000
.equ	CLOCKS_ENABLED1_CLK_SYS_TBMAN_MSB, 16
.equ	CLOCKS_ENABLED1_CLK_SYS_TBMAN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SYSINFO
.equ	CLOCKS_ENABLED1_CLK_SYS_SYSINFO_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SYSINFO_BITS, 0x00008000
.equ	CLOCKS_ENABLED1_CLK_SYS_SYSINFO_MSB, 15
.equ	CLOCKS_ENABLED1_CLK_SYS_SYSINFO_LSB, 15
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SYSCFG
.equ	CLOCKS_ENABLED1_CLK_SYS_SYSCFG_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SYSCFG_BITS, 0x00004000
.equ	CLOCKS_ENABLED1_CLK_SYS_SYSCFG_MSB, 14
.equ	CLOCKS_ENABLED1_CLK_SYS_SYSCFG_LSB, 14
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM9
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM9_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM9_BITS, 0x00002000
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM9_MSB, 13
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM9_LSB, 13
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM8
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM8_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM8_BITS, 0x00001000
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM8_MSB, 12
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM8_LSB, 12
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM7
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM7_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM7_BITS, 0x00000800
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM7_MSB, 11
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM7_LSB, 11
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM6
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM6_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM6_BITS, 0x00000400
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM6_MSB, 10
