konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/clocks.inc
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM6_LSB, 10
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM5
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM5_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM5_BITS, 0x00000200
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM5_MSB, 9
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM5_LSB, 9
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM4
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM4_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM4_BITS, 0x00000100
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM4_MSB, 8
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM4_LSB, 8
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM3
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM3_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM3_BITS, 0x00000080
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM3_MSB, 7
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM3_LSB, 7
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM2
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM2_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM2_BITS, 0x00000040
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM2_MSB, 6
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM2_LSB, 6
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM1
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM1_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM1_BITS, 0x00000020
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM1_MSB, 5
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM0_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM0_BITS, 0x00000010
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM0_MSB, 4
.equ	CLOCKS_ENABLED1_CLK_SYS_SRAM0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SPI1
.equ	CLOCKS_ENABLED1_CLK_SYS_SPI1_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SPI1_BITS, 0x00000008
.equ	CLOCKS_ENABLED1_CLK_SYS_SPI1_MSB, 3
.equ	CLOCKS_ENABLED1_CLK_SYS_SPI1_LSB, 3
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_PERI_SPI1
.equ	CLOCKS_ENABLED1_CLK_PERI_SPI1_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_PERI_SPI1_BITS, 0x00000004
.equ	CLOCKS_ENABLED1_CLK_PERI_SPI1_MSB, 2
.equ	CLOCKS_ENABLED1_CLK_PERI_SPI1_LSB, 2
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_SYS_SPI0
.equ	CLOCKS_ENABLED1_CLK_SYS_SPI0_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_SYS_SPI0_BITS, 0x00000002
.equ	CLOCKS_ENABLED1_CLK_SYS_SPI0_MSB, 1
.equ	CLOCKS_ENABLED1_CLK_SYS_SPI0_LSB, 1
# -----------------------------------------------------------------------------
# Field       : CLOCKS_ENABLED1_CLK_PERI_SPI0
.equ	CLOCKS_ENABLED1_CLK_PERI_SPI0_RESET, 0x0
.equ	CLOCKS_ENABLED1_CLK_PERI_SPI0_BITS, 0x00000001
.equ	CLOCKS_ENABLED1_CLK_PERI_SPI0_MSB, 0
.equ	CLOCKS_ENABLED1_CLK_PERI_SPI0_LSB, 0
# =============================================================================
# Register    : CLOCKS_INTR
# Description : Raw Interrupts
.equ	CLOCKS_INTR_OFFSET, 0x000000c4
.equ	CLOCKS_INTR_BITS, 0x00000001
.equ	CLOCKS_INTR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_INTR_CLK_SYS_RESUS
.equ	CLOCKS_INTR_CLK_SYS_RESUS_RESET, 0x0
.equ	CLOCKS_INTR_CLK_SYS_RESUS_BITS, 0x00000001
.equ	CLOCKS_INTR_CLK_SYS_RESUS_MSB, 0
.equ	CLOCKS_INTR_CLK_SYS_RESUS_LSB, 0
# =============================================================================
# Register    : CLOCKS_INTE
# Description : Interrupt Enable
.equ	CLOCKS_INTE_OFFSET, 0x000000c8
.equ	CLOCKS_INTE_BITS, 0x00000001
.equ	CLOCKS_INTE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_INTE_CLK_SYS_RESUS
.equ	CLOCKS_INTE_CLK_SYS_RESUS_RESET, 0x0
.equ	CLOCKS_INTE_CLK_SYS_RESUS_BITS, 0x00000001
.equ	CLOCKS_INTE_CLK_SYS_RESUS_MSB, 0
.equ	CLOCKS_INTE_CLK_SYS_RESUS_LSB, 0
# =============================================================================
# Register    : CLOCKS_INTF
# Description : Interrupt Force
.equ	CLOCKS_INTF_OFFSET, 0x000000cc
.equ	CLOCKS_INTF_BITS, 0x00000001
.equ	CLOCKS_INTF_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_INTF_CLK_SYS_RESUS
.equ	CLOCKS_INTF_CLK_SYS_RESUS_RESET, 0x0
.equ	CLOCKS_INTF_CLK_SYS_RESUS_BITS, 0x00000001
.equ	CLOCKS_INTF_CLK_SYS_RESUS_MSB, 0
.equ	CLOCKS_INTF_CLK_SYS_RESUS_LSB, 0
# =============================================================================
# Register    : CLOCKS_INTS
# Description : Interrupt status after masking & forcing
.equ	CLOCKS_INTS_OFFSET, 0x000000d0
.equ	CLOCKS_INTS_BITS, 0x00000001
.equ	CLOCKS_INTS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : CLOCKS_INTS_CLK_SYS_RESUS
.equ	CLOCKS_INTS_CLK_SYS_RESUS_RESET, 0x0
.equ	CLOCKS_INTS_CLK_SYS_RESUS_BITS, 0x00000001
.equ	CLOCKS_INTS_CLK_SYS_RESUS_MSB, 0
.equ	CLOCKS_INTS_CLK_SYS_RESUS_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_CLOCKS_H
